{"backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["predictions", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 48, 48, 1], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 8, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_1", "axis": -1}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 8, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_2", "use_bias": false, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_2", "axis": -1}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "separable_conv2d_1", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 16, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_4", "axis": -1}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "separable_conv2d_2", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 16, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_5", "axis": -1}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 16, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_3", "use_bias": false, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_3", "axis": -1}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "separable_conv2d_3", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 32, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_7", "axis": -1}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "separable_conv2d_4", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 32, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_4", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_8", "axis": -1}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 32, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_4", "use_bias": false, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_6", "axis": -1}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "separable_conv2d_5", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 64, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_5", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_10", "axis": -1}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "separable_conv2d_6", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 64, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_6", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_11", "axis": -1}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 64, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_5", "use_bias": false, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_9", "axis": -1}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "separable_conv2d_7", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 128, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_7", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_13", "axis": -1}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "separable_conv2d_8", "class_name": "SeparableConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "strides": [1, 1], "filters": 128, "depthwise_constraint": null, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "pointwise_regularizer": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "pointwise_constraint": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "name": "separable_conv2d_8", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_14", "axis": -1}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 128, "padding": "same", "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_6", "use_bias": false, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "name": "batch_normalization_12", "axis": -1}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 7, "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_7", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "predictions", "class_name": "Activation", "config": {"trainable": true, "name": "predictions", "activation": "softmax"}}]}}