{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.3", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 48, 48, 1], "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": false, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_1", "filters": 8, "strides": [1, 1], "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": false, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_2", "filters": 8, "strides": [1, 1], "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_1", "filters": 16, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_2", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_2", "filters": 16, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_3", "filters": 16, "strides": [2, 2], "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_3", "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_7", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_4", "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_8", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_4", "filters": 32, "strides": [2, 2], "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_6", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_5", "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_10", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_6", "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_11", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_5", "filters": 64, "strides": [2, 2], "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_9", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_7", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_13", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"pointwise_regularizer": null, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "pointwise_constraint": null, "use_bias": false, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "separable_conv2d_8", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_14", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "use_bias": false, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_6", "filters": 128, "strides": [2, 2], "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4", "padding": "same", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_12", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_7", "filters": 7, "strides": [1, 1], "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Activation", "name": "predictions", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "predictions", "activation": "softmax"}}]}}